# GetSelectionFilter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudInstance..::..GetSelectionFilter Method
PointCloudInstance Class See Also
---
Returns the currently active selection filter for this point cloud.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PointCloudFilter GetSelectionFilter()
```

Visual Basic
---
```text
Public Function GetSelectionFilter As PointCloudFilter
```

Visual C++
---
```text
public:
PointCloudFilter^ GetSelectionFilter()
```

# ### Return Value
Currently active selection filter or nullNothingnullptra null reference (Nothing in Visual Basic) if none is active.
# See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace